app/controllers/sessions_controller.rb

  def create
    user = User.find_by_username(params[:session][:username].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'dba' LIMIT 1